alsa-utils
anydesk-bin
arandr
aseprite
audacity
audio-share-bin
autorandr
base
base-devel
bluedevil
blueman
bluez
bluez-utils
bottles
brave-bin
cameractrls
chaotic-keyring
chaotic-mirrorlist
cloudflare-warp-bin
copyq
dbeaver
direnv
docker-compose
dunst
electron29
emacs
featherpad
feh
fish
fisher
fuse3
gamemode
gimp
git
github-desktop
gittyup
glib2
google-chrome
greetd
i3-wm
intel-ucode
jamesdsp-git
jaq
joycond-git
jq
juk
kde-cli-tools
kdialog
keychain
kitty
kolourpaint
kvantum
kvantum-theme-materia
lib32-llvm-libs
lib32-mesa
lib32-vulkan-icd-loader
libfabric
libid3tag
libkdcraw5
libnewt
libretro-beetle-psx
libretro-beetle-psx-hw
libretro-core-info
libretro-desmume
libretro-flycast
libretro-genesis-plus-gx
libretro-kronos
libretro-melonds
libretro-mesen
libretro-mesen-s
libretro-mgba
libretro-mupen64plus-next-git
libretro-parallel-n64
libretro-pcsx2
libretro-play
libretro-ppsspp
libretro-sameboy
libretro-shaders-slang
libretro-swanstation-git
libretro-yabause
libsbsms
libsodium
libvdpau-va-gl
linux-zen
lmms-git
logseq-desktop-bin
lostfiles
lsof
lvm2
lxqt-archiver
lxqt-openssh-askpass
lxqt-policykit
lxqt-sudo
materia-gtk-theme
materia-kde
mesa-utils
micro
microsoft-edge-beta-bin
microsoft-edge-stable-bin
mkinitcpio
moonlight-qt
mpc-qt
networkmanager
nix
nm-tray
noto-fonts-emoji
numlockx
obs-studio-tytan652
obsidian
onedriver
onevpl-intel-gpu
openssh
pacman-contrib
pamixer
papirus-icon-theme
parsec-bin
paru
pavucontrol-qt
pcmanfm-qt
pcsclite
picom-git
pipewire-pulse
podman
polybar
protobuf
psmisc
python-cryptography
python-protobuf
python-shiboken2
python-trove-classifiers
qalculate-qt
qbittorrent
qps
qt5ct
qt6ct
qview
rclone
retroarch
