(package! ryo-modal :pin "b9e6a0f33b9e2aeb6088accd23ed312083d8f707")

(package! point-undo :pin "d875c94522ad6430294c37d627e332d726221e02")

(package! evil-core
  :recipe (:local-repo "."))

(package! char-occurrence
  :recipe (:local-repo "./commands"))

(package! open-line
  :recipe (:local-repo "./commands"))

(package! region-boundaries
  :recipe (:local-repo "./commands"))

(package! save-kmacro
  :recipe (:local-repo "./commands"))

(package! save-point
  :recipe (:local-repo "./commands"))

(package! secondary-selection
  :recipe (:local-repo "./commands"))

(package! smarter-commands
  :recipe (:local-repo "./commands"))

(package! text-object
  :recipe (:local-repo "./commands"))
